{
  "posts": [
    {
      "id": "CSCI4239-2025-01-13-Homework-01",
      "title": "CSCI4239 Homework 1: NDC to RGB Shader",
      "date": "2025-01-13",
      "tags": {
        "Course": ["CSCI4239", "Advanced Computer Graphics"],
        "Topic": ["OpenGL", "GLSL Shaders"]
      },
      "content": "Goals for this homework (Written 01-13):\nI want to make sure I understand the basic concepts first so will be initially working on making it look/work similarly to what we were shown in class. Once I get that working though I want to try to do a quick implementation of my falling stars particles that I made with P5.js last year.\n\n\nReflection (Written 1-14/1-15):\nThe basic NDC to RGB shader was pretty straightforward, especially after I gave up trying to do it completely in the frag shader. I know it can be done using just the frag shader, but realized after fiddling for a bit that I was just reverse engineering something that the vertex shader already did. Once I got the trivial shader working I wanted to add in my stars, for which I repurposed the particle system I wrote for my final project in CSCI4229 last semester. Getting the NDC to RGB color swap to work was simple, as I just had to change the original color assignment to what I had done for the NDC to RGB shader, but calculating a star shape for my point sprites was an absolute brainteaser! I ended up reading some blogs and The Book of Shaders to figure out how to do it and got a little pinwheel looking thing before I decided to get some help from Claude. I asked it to not give me the answer directly but to give me feedback on my thinking process, and that helped me realize I was forgetting to mix between the inner and outer radius of the star. I'm pretty happy with how this turned out! I would like to add some twinkling and rotation for the next pass I take on the stars, but I'm happy I decided to add a little extra to this assignment.\n\n<a href=\"https://github.com/b00kworm4lyf3/CSCI4239-hw1-NDC2RGB\" target=\"_blank\" rel=\"noopener noreferrer\">Link to GitHub Repo</a>",
      "images": [
        {
          "src": "img/example.jpg",
          "caption": "Optional caption for the image"
        }
      ],
      "assignmentDetails": "Create a program that displays a scene in 3D that can be viewed from any direction under user control. Example 1 would be a good starting point.\n\nThe color of every vertex in every object should be set using a shader such that the coordinates of the vertex in Normalized Device Coordinates ([-1,+1] in x,y,z) determines the color of the vertex using a linear mapping in RGB space [0-1].\n\nYour program must work in both orthogonal and perspective, so NDC space starts as 4D homogeneous coordinates and w will not be 1.\n\nThis is a trivial shader, and the vertex and fragment shader should each be only one or two lines.  So make an effort of making this as elegant as you can. Consider this Shader Golf.\n\nWhat to submit:\n1) One ZIP archive containing all files you are submitting;\n\t2) Source code, makefile and any data files I need;\n\t3) README with brief instructions on how to use the program;\n\t4) Time it took you to complete the assignment.\n\nDo a \"make clean\" before creating the ZIP file to clean out intermediate files.\n\nMake sure your program unzips in the current folder.\n\nYou may use the CSCIx5239 library, but make sure that you know what each function from that library that you use is doing."
    },
    {
      "id": "ATLS3300-2025-01-17-Test",
      "title": "ATLS3300 Test Post",
      "date": "2025-01-17",
      "tags": {
        "Course": ["ATLS3300", "Object"],
        "Topic": ["Arduino", "Physical Computing"]
      },
      "content": "Test post to ensure filtering is working correctly.",
      "images": [
        {
          "src": "img/example.jpg",
          "caption": "Optional caption for the image"
        }
      ],
      "assignmentDetails": "This is where Canvas assignment details would go."
    }
  ]
}